In [1]:
import pandas as pd
import numpy as np

In [2]:
df_yield=pd.read_csv("yield.csv")

In [3]:
df_yield

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value
0,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1961,1961,hg/ha,14000
1,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1962,1962,hg/ha,14000
2,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1963,1963,hg/ha,14260
3,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1964,1964,hg/ha,14257
4,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,1965,1965,hg/ha,14400
...,...,...,...,...,...,...,...,...,...,...,...,...
56712,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2012,2012,hg/ha,24420
56713,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2013,2013,hg/ha,22888
56714,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2014,2014,hg/ha,21357
56715,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2015,2015,hg/ha,19826
56716,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2016,2016,hg/ha,18294

In [4]:
# drop unwanted columns.
df_yield = df_yield.drop(['Year Code','Element Code','Element','Year Code','Area Code','Domain Code','Domain','Unit','Item Code'], axis=1)

In [5]:
df_yield

              Area   Item  Year  Value
0      Afghanistan  Maize  1961  14000
1      Afghanistan  Maize  1962  14000
2      Afghanistan  Maize  1963  14260
3      Afghanistan  Maize  1964  14257
4      Afghanistan  Maize  1965  14400
...            ...    ...   ...    ...
56712     Zimbabwe  Wheat  2012  24420
56713     Zimbabwe  Wheat  2013  22888
56714     Zimbabwe  Wheat  2014  21357
56715     Zimbabwe  Wheat  2015  19826
56716     Zimbabwe  Wheat  2016  18294

[56717 rows x 4 columns]

In [6]:
# rename columns.
df_yield = df_yield.rename(columns={"Value": "Yield (hg/ha)","Area":"Country"})
df_yield.head()

       Country   Item  Year  Yield (hg/ha)
0  Afghanistan  Maize  1961          14000
1  Afghanistan  Maize  1962          14000
2  Afghanistan  Maize  1963          14260
3  Afghanistan  Maize  1964          14257
4  Afghanistan  Maize  1965          14400

In [7]:
df_yield["Country"].nunique()

212

In [8]:
df_yield['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belgium-Luxembourg', 'Belize',
       'Benin', 'Bermuda', 'Bhutan', 'Bolivia (Plurinational State of)',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Chile', 'China',
       'China, Hong Kong SAR', 'China, mainland',
       'China, Taiwan Province of', 'Colombia', 'Comoros', 'Congo',
       'Cook Islands', 'Costa Rica', "CÃ´te d'Ivoire", 'Croatia', 'Cuba',
       'Cyprus', 'Czechia', 'Czechoslovakia',
       "Democratic People's Republic of Korea",
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Ethiopia PDR', 'Faroe Islands', 'Fiji', 'Finland',
       'France', 'French Guiana', 'French Polynesia', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guadeloupe',
       'Guam', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran (Islamic Republic of)', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kuwait',
       'Kyrgyzstan', "Lao People's Democratic Republic", 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Martinique', 'Mauritania', 'Mauritius', 'Mexico',
       'Micronesia (Federated States of)', 'Mongolia', 'Montenegro',
       'Montserrat', 'Morocco', 'Mozambique', 'Myanmar', 'Namibia',
       'Nepal', 'Netherlands', 'New Caledonia', 'New Zealand',
       'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norway',
       'Occupied Palestinian Territory', 'Oman',
       'Pacific Islands Trust Territory', 'Pakistan', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'RÃ©union', 'Romania', 'Russian Federation',
       'Rwanda', 'Saint Kitts and Nevis', 'Saint Lucia',
       'Saint Vincent and the Grenadines', 'Samoa',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Serbia and Montenegro', 'Seychelles', 'Sierra Leone', 'Singapore',
       'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South Sudan', 'Spain', 'Sri Lanka', 'Sudan',
       'Sudan (former)', 'Suriname', 'Eswatini', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'The former Yugoslav Republic of Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United Republic of Tanzania',
       'United States of America', 'Uruguay', 'USSR', 'Uzbekistan',
       'Vanuatu', 'Venezuela (Bolivarian Republic of)', 'Viet Nam',
       'Wallis and Futuna Islands', 'Yemen', 'Yugoslav SFR', 'Zambia',
       'Zimbabwe'], dtype=object)

In [9]:
df_yield

           Country   Item  Year  Yield (hg/ha)
0      Afghanistan  Maize  1961          14000
1      Afghanistan  Maize  1962          14000
2      Afghanistan  Maize  1963          14260
3      Afghanistan  Maize  1964          14257
4      Afghanistan  Maize  1965          14400
...            ...    ...   ...            ...
56712     Zimbabwe  Wheat  2012          24420
56713     Zimbabwe  Wheat  2013          22888
56714     Zimbabwe  Wheat  2014          21357
56715     Zimbabwe  Wheat  2015          19826
56716     Zimbabwe  Wheat  2016          18294

[56717 rows x 4 columns]

In [10]:
df_yield=df_yield.loc[(df_yield["Country"]!='American Samoa')&(df_yield["Country"]!='Belgium-Luxembourg')&\
                     (df_yield["Country"]!='Bermuda')&(df_yield["Country"]!='Cayman Islands')&\
                     (df_yield["Country"]!='China, Hong Kong SAR')&(df_yield["Country"]!='China, mainland')&\
                     (df_yield["Country"]!='China, Taiwan Province of')&(df_yield["Country"]!='Cook Islands')&\
                     (df_yield["Country"]!='Czechoslovakia')&(df_yield["Country"]!='Cook Islands')&\
                     (df_yield["Country"]!='Ethiopia PDR')&(df_yield["Country"]!='Faroe Islands')&\
                     (df_yield["Country"]!='French Guiana')&(df_yield["Country"]!='French Polynesia')&\
                     (df_yield["Country"]!='Guadeloupe')&(df_yield["Country"]!='Guam')&\
                     (df_yield["Country"]!='Martinique')&(df_yield["Country"]!='Montserrat')&\
                     (df_yield["Country"]!='New Caledonia')&(df_yield["Country"]!='Niue')&\
                     (df_yield["Country"]!='Pacific Islands Trust Territory')&(df_yield["Country"]!='Puerto Rico')&\
                     (df_yield["Country"]!='RÃ©union')&(df_yield["Country"]!='Serbia and Montenegro')&\
                     (df_yield["Country"]!='Sudan (former)')&(df_yield["Country"]!='USSR')&\
                     (df_yield["Country"]!='Wallis and Futuna Islands')&(df_yield["Country"]!='Yugoslav SFR')]

In [11]:
df_yield

           Country   Item  Year  Yield (hg/ha)
0      Afghanistan  Maize  1961          14000
1      Afghanistan  Maize  1962          14000
2      Afghanistan  Maize  1963          14260
3      Afghanistan  Maize  1964          14257
4      Afghanistan  Maize  1965          14400
...            ...    ...   ...            ...
56712     Zimbabwe  Wheat  2012          24420
56713     Zimbabwe  Wheat  2013          22888
56714     Zimbabwe  Wheat  2014          21357
56715     Zimbabwe  Wheat  2015          19826
56716     Zimbabwe  Wheat  2016          18294

[51297 rows x 4 columns]

In [12]:
df_yield=df_yield.replace({'Bolivia (Plurinational State of)':"Bolivia",'Brunei Darussalam':"Brunei"\
                           ,"Democratic People's Republic of Korea":"North Korea","Iran (Islamic Republic of)":"Iran"\
                          ,'Micronesia (Federated States of)':"Micronesia","Lao People's Democratic Republic":"Laos"\
                          ,'Russian Federation':"Russia",'Syrian Arab Republic':'Syria'\
                          ,'United Republic of Tanzania':'Tanzania','Venezuela (Bolivarian Republic of)':"Venezuela"\
                          ,'Occupied Palestinian Territory':"Palestine State",'Viet Nam':'Vietnam'\
                          ,'Republic of Moldova':"Moldova",'The former Yugoslav Republic of Macedonia':"North Macedonia"})

In [13]:
df_yield['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China', 'Colombia', 'Comoros', 'Congo',
       'Costa Rica', "CÃ´te d'Ivoire", 'Croatia', 'Cuba', 'Cyprus',
       'Czechia', 'North Korea', 'Democratic Republic of the Congo',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guatemala',
       'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Mauritania', 'Mauritius', 'Mexico', 'Micronesia',
       'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'Norway', 'Palestine State', 'Oman',
       'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Qatar', 'Republic of Korea',
       'Moldova', 'Romania', 'Russia', 'Rwanda', 'Saint Kitts and Nevis',
       'Saint Lucia', 'Saint Vincent and the Grenadines', 'Samoa',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'South Sudan',
       'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Eswatini', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Thailand',
       'North Macedonia', 'Timor-Leste', 'Togo', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'Tanzania', 'United States of America', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [14]:
df_yield["Country"].nunique()

185

In [15]:
df_yield["Year"].unique()

array([1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982,
       1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993,
       1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004,
       2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015,
       2016], dtype=int64)

In [16]:
df_yield["Year"].nunique()

56

In [17]:
df_yield["Item"].unique()

array(['Maize', 'Potatoes', 'Rice, paddy', 'Wheat', 'Sorghum', 'Soybeans',
       'Cassava', 'Sweet potatoes', 'Yams', 'Plantains and others'],
      dtype=object)

In [18]:
df_yield["Item"].nunique()

10

In [19]:
df_yield[df_yield.duplicated()==True]

Empty DataFrame
Columns: [Country, Item, Year, Yield (hg/ha)]
Index: []

In [20]:
df_yield.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51297 entries, 0 to 56716
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country        51297 non-null  object
 1   Item           51297 non-null  object
 2   Year           51297 non-null  int64
 3   Yield (hg/ha)  51297 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.0+ MB

In [21]:
df_yield.describe()

               Year   Yield (hg/ha)
count  51297.000000    51297.000000
mean    1990.041854    60689.400589
std       16.135467    67618.802402
min     1961.000000        0.000000
25%     1976.000000    15000.000000
50%     1991.000000    35204.000000
75%     2004.000000    83093.000000
max     2016.000000  1000000.000000

In [22]:
df_yield[df_yield["Yield (hg/ha)"]==0]

               Country     Item  Year  Yield (hg/ha)
37860  Palestine State  Sorghum  1999              0

In [23]:
df_yield=df_yield[df_yield["Yield (hg/ha)"]!=0]

In [24]:
df_yield

           Country   Item  Year  Yield (hg/ha)
0      Afghanistan  Maize  1961          14000
1      Afghanistan  Maize  1962          14000
2      Afghanistan  Maize  1963          14260
3      Afghanistan  Maize  1964          14257
4      Afghanistan  Maize  1965          14400
...            ...    ...   ...            ...
56712     Zimbabwe  Wheat  2012          24420
56713     Zimbabwe  Wheat  2013          22888
56714     Zimbabwe  Wheat  2014          21357
56715     Zimbabwe  Wheat  2015          19826
56716     Zimbabwe  Wheat  2016          18294

[51296 rows x 4 columns]

In [25]:
df_yield.isnull().sum()

Country          0
Item             0
Year             0
Yield (hg/ha)    0
dtype: int64

In [26]:
df_yield.isna().sum()

Country          0
Item             0
Year             0
Yield (hg/ha)    0
dtype: int64

In [27]:
df_rain=pd.read_csv("rainfall.csv")

In [28]:
df_rain

             Area  Year average_rain_fall_mm_per_year
0     Afghanistan  1985                           327
1     Afghanistan  1986                           327
2     Afghanistan  1987                           327
3     Afghanistan  1989                           327
4     Afghanistan  1990                           327
...           ...   ...                           ...
6722     Zimbabwe  2013                           657
6723     Zimbabwe  2014                           657
6724     Zimbabwe  2015                           657
6725     Zimbabwe  2016                           657
6726     Zimbabwe  2017                           657

[6727 rows x 3 columns]

In [29]:
df_rain = df_rain.rename(columns={" Area":"Country","average_rain_fall_mm_per_year":"Average Rainfall (mm/year)"})

In [30]:
df_rain

          Country  Year Average Rainfall (mm/year)
0     Afghanistan  1985                        327
1     Afghanistan  1986                        327
2     Afghanistan  1987                        327
3     Afghanistan  1989                        327
4     Afghanistan  1990                        327
...           ...   ...                        ...
6722     Zimbabwe  2013                        657
6723     Zimbabwe  2014                        657
6724     Zimbabwe  2015                        657
6725     Zimbabwe  2016                        657
6726     Zimbabwe  2017                        657

[6727 rows x 3 columns]

In [31]:
df_rain["Country"].nunique()

217

In [32]:
df_rain["Country"].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra',
       'Angola', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba',
       'Australia', 'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain',
       'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin',
       'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'British Virgin Islands',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Channel Islands', 'Chile',
       'China', 'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Curacao',
       'Cyprus', 'Czech Republic', 'Denmark', 'Djibouti', 'Dominica',
       'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Eswatini', 'Ethiopia',
       'Faroe Islands', 'Fiji', 'Finland', 'France', 'French Polynesia',
       'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar',
       'Greece', 'Greenland', 'Grenada', 'Guam', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hong Kong SAR, China', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati',
       'North Korea', 'South Korea ', 'Kosovo', 'Kuwait',
       'Kyrgyz Republic', 'Lao PDR', 'Latvia', 'Lebanon', 'Lesotho',
       'Liberia', 'Libya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
       'Macao SAR, China', 'Macedonia', 'Madagascar', 'Malawi',
       'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands',
       'Mauritania', 'Mauritius', 'Mexico', 'Micronesia', 'Moldova',
       'Monaco', 'Mongolia', 'Montenegro', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nauru', 'Nepal', 'Netherlands',
       'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
       'Northern Mariana Islands', 'Norway', 'Oman', 'Pakistan', 'Palau',
       'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines',
       'Poland', 'Portugal', 'Puerto Rico', 'Qatar', 'Romania', 'Russia',
       'Rwanda', 'Samoa', 'San Marino', 'Sao Tome and Principe',
       'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone',
       'Singapore', 'Sint Maarten (Dutch part)', 'Slovak Republic',
       'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa',
       'South Sudan', 'Spain', 'Sri Lanka', 'St. Kitts and Nevis',
       'St. Lucia', 'St. Martin (French part)',
       'St. Vincent and the Grenadines', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor-Leste', 'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United States', 'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela, RB', 'Vietnam', 'Virgin Islands (U.S.)',
       'West Bank and Gaza', 'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [33]:
df_rain=df_rain.loc[(df_rain["Country"]!='American Samoa')&(df_rain["Country"]!='Aruba')&\
                    (df_rain["Country"]!='Bermuda')&(df_rain["Country"]!='American Samoa')&\
                    (df_rain["Country"]!='British Virgin Islands')&(df_rain["Country"]!='Cayman Islands')&\
                    (df_rain["Country"]!='Channel Islands')&(df_rain["Country"]!='Curacao')&\
                    (df_rain["Country"]!='Faroe Islands')&(df_rain["Country"]!='French Polynesia')&\
                    (df_rain["Country"]!='Gibraltar')&(df_rain["Country"]!='Guam')&\
                    (df_rain["Country"]!='Greenland')&(df_rain["Country"]!='Isle of Man')&\
                    (df_rain["Country"]!='Kosovo')&(df_rain["Country"]!='Macao SAR, China')&\
                    (df_rain["Country"]!='Northern Mariana Islands')&(df_rain["Country"]!='New Caledonia')&\
                    (df_rain["Country"]!='Puerto Rico')&(df_rain["Country"]!='Sint Maarten (Dutch part)')&\
                    (df_rain["Country"]!='St. Martin (French part)')&(df_rain["Country"]!='Virgin Islands (U.S.)')&\
                    (df_rain["Country"]!='Turks and Caicos Islands')&(df_rain["Country"]!='Sint Maarten (Dutch part)')&\
                    (df_rain["Country"]!='West Bank and Gaza')&(df_rain["Country"]!='Hong Kong SAR, China')]

In [34]:
df_rain['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia',
       'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.', 'Costa Rica',
       "Cote d'Ivoire", 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon',
       'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada',
       'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran',
       'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'North Korea', 'South Korea ',
       'Kuwait', 'Kyrgyz Republic', 'Lao PDR', 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia',
       'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Mauritania',
       'Mauritius', 'Mexico', 'Micronesia', 'Moldova', 'Monaco',
       'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nauru', 'Nepal', 'Netherlands', 'New Zealand',
       'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman', 'Pakistan',
       'Palau', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Qatar', 'Romania', 'Russia',
       'Rwanda', 'Samoa', 'San Marino', 'Sao Tome and Principe',
       'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone',
       'Singapore', 'Slovak Republic', 'Slovenia', 'Solomon Islands',
       'Somalia', 'South Africa', 'South Sudan', 'Spain', 'Sri Lanka',
       'St. Kitts and Nevis', 'St. Lucia',
       'St. Vincent and the Grenadines', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor-Leste', 'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Kingdom', 'United States',
       'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela, RB', 'Vietnam',
       'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [35]:
df_rain=df_rain.replace({'Brunei Darussalam':"Brunei",'Congo, Rep.':"Republic of the Congo",'Congo, Dem. Rep.':"Democratic Republic of the Congo"\
                           ,'Kyrgyz Republic':'Kyrgyzstan'\
                          ,'Slovak Republic':"Slovakia",'Lao PDR':"Laos"\
                          ,'Venezuela, RB':"Venezuela",'Czech Republic':"Czechia"})

In [36]:
df_rain['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China', 'Colombia', 'Comoros',
       'Democratic Republic of the Congo', 'Republic of the Congo',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Cyprus',
       'Czechia', 'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea',
       'Estonia', 'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France',
       'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece',
       'Grenada', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana',
       'Haiti', 'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan',
       'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati', 'North Korea',
       'South Korea ', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Liechtenstein',
       'Lithuania', 'Luxembourg', 'Macedonia', 'Madagascar', 'Malawi',
       'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands',
       'Mauritania', 'Mauritius', 'Mexico', 'Micronesia', 'Moldova',
       'Monaco', 'Mongolia', 'Montenegro', 'Morocco', 'Mozambique',
       'Myanmar', 'Namibia', 'Nauru', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Palau', 'Panama', 'Papua New Guinea', 'Paraguay',
       'Peru', 'Philippines', 'Poland', 'Portugal', 'Qatar', 'Romania',
       'Russia', 'Rwanda', 'Samoa', 'San Marino', 'Sao Tome and Principe',
       'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone',
       'Singapore', 'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South Sudan', 'Spain', 'Sri Lanka',
       'St. Kitts and Nevis', 'St. Lucia',
       'St. Vincent and the Grenadines', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor-Leste', 'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Kingdom', 'United States',
       'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela', 'Vietnam',
       'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [37]:
df_rain['Country'].nunique()

193

In [38]:
df_rain["Year"].unique()

array([1985, 1986, 1987, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996,
       1997, 1998, 1999, 2000, 2001, 2002, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017], dtype=int64)

In [39]:
df_rain["Year"].nunique()

31

In [40]:
df_rain[df_rain.duplicated()==True]

Empty DataFrame
Columns: [Country, Year, Average Rainfall (mm/year)]
Index: []

In [41]:
df_rain['Average Rainfall (mm/year)'].nunique()

171

In [42]:
df_rain.isnull().sum()

Country                        0
Year                           0
Average Rainfall (mm/year)    92
dtype: int64

In [43]:
df_rain.isna().sum()

Country                        0
Year                           0
Average Rainfall (mm/year)    92
dtype: int64

In [44]:
df_rain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5983 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Country                     5983 non-null   object
 1   Year                        5983 non-null   int64
 2   Average Rainfall (mm/year)  5891 non-null   object
dtypes: int64(1), object(2)
memory usage: 187.0+ KB

In [45]:
df_rain['Average Rainfall (mm/year)'] = pd.to_numeric(df_rain['Average Rainfall (mm/year)'],errors = 'coerce')
df_rain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5983 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Country                     5983 non-null   object
 1   Year                        5983 non-null   int64
 2   Average Rainfall (mm/year)  5885 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 187.0+ KB

In [46]:
df_rain = df_rain.dropna()

In [47]:
df_rain['Average Rainfall (mm/year)']=df_rain['Average Rainfall (mm/year)'].astype(int)

In [48]:
df_rain

          Country  Year  Average Rainfall (mm/year)
0     Afghanistan  1985                         327
1     Afghanistan  1986                         327
2     Afghanistan  1987                         327
3     Afghanistan  1989                         327
4     Afghanistan  1990                         327
...           ...   ...                         ...
6722     Zimbabwe  2013                         657
6723     Zimbabwe  2014                         657
6724     Zimbabwe  2015                         657
6725     Zimbabwe  2016                         657
6726     Zimbabwe  2017                         657

[5885 rows x 3 columns]

In [49]:
df_rain.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5885 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Country                     5885 non-null   object
 1   Year                        5885 non-null   int64
 2   Average Rainfall (mm/year)  5885 non-null   int32
dtypes: int32(1), int64(1), object(1)
memory usage: 160.9+ KB

In [50]:
df_rain.describe()

              Year  Average Rainfall (mm/year)
count  5885.000000                 5885.000000
mean   2001.366015                 1123.655395
std       9.526303                  785.755655
min    1985.000000                   51.000000
25%    1993.000000                  536.000000
50%    2001.000000                 1010.000000
75%    2010.000000                 1646.000000
max    2017.000000                 3240.000000

In [51]:
df_pes=pd.read_csv("pesticides.csv")

In [52]:
df_pes

,Domain,Area,Element,Item,Year,Unit,Value
0,Pesticides Use,Albania,Use,Pesticides (total),1990,tonnes of active ingredients,121.00
1,Pesticides Use,Albania,Use,Pesticides (total),1991,tonnes of active ingredients,121.00
2,Pesticides Use,Albania,Use,Pesticides (total),1992,tonnes of active ingredients,121.00
3,Pesticides Use,Albania,Use,Pesticides (total),1993,tonnes of active ingredients,121.00
4,Pesticides Use,Albania,Use,Pesticides (total),1994,tonnes of active ingredients,201.00
...,...,...,...,...,...,...,...
4344,Pesticides Use,Zimbabwe,Use,Pesticides (total),2012,tonnes of active ingredients,3375.53
4345,Pesticides Use,Zimbabwe,Use,Pesticides (total),2013,tonnes of active ingredients,2550.07
4346,Pesticides Use,Zimbabwe,Use,Pesticides (total),2014,tonnes of active ingredients,2185.07
4347,Pesticides Use,Zimbabwe,Use,Pesticides (total),2015,tonnes of active ingredients,2185.07
4348,Pesticides Use,Zimbabwe,Use,Pesticides (total),2016,tonnes of active ingredients,2185.07

In [53]:
df_pes = df_pes.drop(['Element','Domain','Unit','Item'], axis=1)

In [54]:
df_pes

          Area  Year    Value
0      Albania  1990   121.00
1      Albania  1991   121.00
2      Albania  1992   121.00
3      Albania  1993   121.00
4      Albania  1994   201.00
...        ...   ...      ...
4344  Zimbabwe  2012  3375.53
4345  Zimbabwe  2013  2550.07
4346  Zimbabwe  2014  2185.07
4347  Zimbabwe  2015  2185.07
4348  Zimbabwe  2016  2185.07

[4349 rows x 3 columns]

In [55]:
df_pes = df_pes.rename(columns={"Value": "Pesticides (Tonnes)","Area":"Country"})

In [56]:
df_pes

       Country  Year  Pesticides (Tonnes)
0      Albania  1990               121.00
1      Albania  1991               121.00
2      Albania  1992               121.00
3      Albania  1993               121.00
4      Albania  1994               201.00
...        ...   ...                  ...
4344  Zimbabwe  2012              3375.53
4345  Zimbabwe  2013              2550.07
4346  Zimbabwe  2014              2185.07
4347  Zimbabwe  2015              2185.07
4348  Zimbabwe  2016              2185.07

[4349 rows x 3 columns]

In [57]:
df_pes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4349 entries, 0 to 4348
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              4349 non-null   object
 1   Year                 4349 non-null   int64
 2   Pesticides (Tonnes)  4349 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 102.1+ KB

In [58]:
df_pes["Country"].nunique()

168

In [59]:
df_pes["Country"].unique()

array(['Albania', 'Algeria', 'Angola', 'Antigua and Barbuda', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas',
       'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium',
       'Belgium-Luxembourg', 'Belize', 'Bermuda', 'Bhutan',
       'Bolivia (Plurinational State of)', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China, Hong Kong SAR', 'China, Macao SAR',
       'China, mainland', 'China, Taiwan Province of', 'Colombia',
       'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', "CÃ´te d'Ivoire",
       'Croatia', 'Cyprus', 'Czechia', 'Denmark', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'French Polynesia',
       'Gambia', 'Germany', 'Ghana', 'Greece', 'Guatemala', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras', 'Hungary',
       'Iceland', 'India', 'Indonesia', 'Iran (Islamic Republic of)',
       'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kuwait', 'Kyrgyzstan',
       "Lao People's Democratic Republic", 'Latvia', 'Lebanon', 'Lesotho',
       'Libya', 'Lithuania', 'Luxembourg', 'Madagascar', 'Malawi',
       'Malaysia', 'Maldives', 'Mali', 'Malta', 'Mauritania', 'Mauritius',
       'Mexico', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nepal', 'Netherlands', 'New Caledonia', 'New Zealand',
       'Nicaragua', 'Niger', 'Norway', 'Occupied Palestinian Territory',
       'Oman', 'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay',
       'Peru', 'Poland', 'Portugal', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'Romania', 'Russian Federation', 'Rwanda',
       'Saint Kitts and Nevis', 'Saint Lucia', 'Samoa', 'Saudi Arabia',
       'Senegal', 'Serbia and Montenegro', 'Seychelles', 'Slovakia',
       'Slovenia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Sudan (former)', 'Suriname', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'The former Yugoslav Republic of Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Uganda', 'Ukraine', 'United Kingdom',
       'United Republic of Tanzania', 'United States of America',
       'Uruguay', 'USSR', 'Vanuatu', 'Venezuela (Bolivarian Republic of)',
       'Viet Nam', 'Yemen', 'Yugoslav SFR', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [60]:
df_pes=df_pes.loc[(df_pes["Country"]!='Belgium-Luxembourg')&(df_pes["Country"]!='Bermuda')&\
                  (df_pes["Country"]!='China, Hong Kong SAR')&(df_pes["Country"]!='China, mainland')&\
                  (df_pes["Country"]!='China, Taiwan Province of')&(df_pes["Country"]!='China, Macao SAR')&\
                  (df_pes["Country"]!='French Polynesia')&(df_pes["Country"]!='New Caledonia')&\
                  (df_pes["Country"]!='Sudan (former)')&(df_pes["Country"]!='USSR')&\
                  (df_pes["Country"]!='Yugoslav SFR')&(df_pes["Country"]!='Cook Islands')]

In [61]:
df_pes=df_pes.replace({'Brunei Darussalam':"Brunei",'Bolivia (Plurinational State of)':"Bolivia",\
                       'Iran (Islamic Republic of)':"Iran","Lao People's Democratic Republic":"Laos",\
                       'Occupied Palestinian Territory':"Palestine State",'Republic of Korea':"South Korea",\
                       'Republic of Moldova':"Moldova",'Russian Federation':"Russia",'Syrian Arab Republic':"Syria",\
                       'The former Yugoslav Republic of Macedonia':"North Macedonia",'United Republic of Tanzania':"Tanzania"\
                       ,'Venezuela (Bolivarian Republic of)':"Venezuela",'Viet Nam':"Vietnam"})

In [62]:
df_pes["Country"].unique()

array(['Albania', 'Algeria', 'Angola', 'Antigua and Barbuda', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahamas',
       'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium',
       'Belize', 'Bhutan', 'Bolivia', 'Botswana', 'Brazil', 'Brunei',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'Colombia',
       'Comoros', 'Congo', 'Costa Rica', "CÃ´te d'Ivoire", 'Croatia',
       'Cyprus', 'Czechia', 'Denmark', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Eritrea', 'Estonia', 'Ethiopia', 'Fiji',
       'Finland', 'France', 'Gambia', 'Germany', 'Ghana', 'Greece',
       'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran',
       'Iraq', 'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia',
       'Lebanon', 'Lesotho', 'Libya', 'Lithuania', 'Luxembourg',
       'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta',
       'Mauritania', 'Mauritius', 'Mexico', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Norway', 'Palestine State',
       'Oman', 'Pakistan', 'Panama', 'Papua New Guinea', 'Paraguay',
       'Peru', 'Poland', 'Portugal', 'Qatar', 'South Korea', 'Moldova',
       'Romania', 'Russia', 'Rwanda', 'Saint Kitts and Nevis',
       'Saint Lucia', 'Samoa', 'Saudi Arabia', 'Senegal',
       'Serbia and Montenegro', 'Seychelles', 'Slovakia', 'Slovenia',
       'South Africa', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname',
       'Sweden', 'Switzerland', 'Syria', 'Tajikistan', 'Thailand',
       'North Macedonia', 'Timor-Leste', 'Togo', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Uganda', 'Ukraine', 'United Kingdom', 'Tanzania',
       'United States of America', 'Uruguay', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [63]:
df_pes["Country"].nunique()

156

In [64]:
df_pes["Year"].nunique()

27

In [65]:
df_pes["Year"].unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016], dtype=int64)

In [66]:
df_pes.isnull().sum()

Country                0
Year                   0
Pesticides (Tonnes)    0
dtype: int64

In [67]:
df_pes[df_pes.duplicated()==True]

Empty DataFrame
Columns: [Country, Year, Pesticides (Tonnes)]
Index: []

In [68]:
df_pes.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4097 entries, 0 to 4348
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              4097 non-null   object
 1   Year                 4097 non-null   int64
 2   Pesticides (Tonnes)  4097 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ KB

In [69]:
df_pes.describe()

             Year  Pesticides (Tonnes)
count  4097.00000          4097.000000
mean   2003.19380         12335.799990
std       7.71891         41289.457399
min    1990.00000             0.000000
25%    1997.00000           105.000000
50%    2003.00000          1245.940000
75%    2010.00000          7744.500000
max    2016.00000        434540.760000

In [70]:
df_pes

       Country  Year  Pesticides (Tonnes)
0      Albania  1990               121.00
1      Albania  1991               121.00
2      Albania  1992               121.00
3      Albania  1993               121.00
4      Albania  1994               201.00
...        ...   ...                  ...
4344  Zimbabwe  2012              3375.53
4345  Zimbabwe  2013              2550.07
4346  Zimbabwe  2014              2185.07
4347  Zimbabwe  2015              2185.07
4348  Zimbabwe  2016              2185.07

[4097 rows x 3 columns]

In [71]:
df_temp=pd.read_csv("temp.csv")

In [72]:
df_temp

       year        country  avg_temp
0      1849  CÃ´te D'Ivoire     25.58
1      1850  CÃ´te D'Ivoire     25.52
2      1851  CÃ´te D'Ivoire     25.67
3      1852  CÃ´te D'Ivoire       NaN
4      1853  CÃ´te D'Ivoire       NaN
...     ...            ...       ...
71306  2009         Mexico     21.76
71307  2010         Mexico     20.90
71308  2011         Mexico     21.55
71309  2012         Mexico     21.52
71310  2013         Mexico     22.19

[71311 rows x 3 columns]

In [73]:
df_temp = df_temp.rename(columns={"year": "Year","country":"Country","avg_temp":"Average Temperature"})

In [74]:
df_temp

       Year        Country  Average Temperature
0      1849  CÃ´te D'Ivoire                25.58
1      1850  CÃ´te D'Ivoire                25.52
2      1851  CÃ´te D'Ivoire                25.67
3      1852  CÃ´te D'Ivoire                  NaN
4      1853  CÃ´te D'Ivoire                  NaN
...     ...            ...                  ...
71306  2009         Mexico                21.76
71307  2010         Mexico                20.90
71308  2011         Mexico                21.55
71309  2012         Mexico                21.52
71310  2013         Mexico                22.19

[71311 rows x 3 columns]

In [75]:
df_temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71311 entries, 0 to 71310
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year                 71311 non-null  int64
 1   Country              71311 non-null  object
 2   Average Temperature  68764 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [76]:
df_temp["Country"].unique()

array(["CÃ´te D'Ivoire", 'United Arab Emirates', 'Nigeria', 'Ghana',
       'Turkey', 'Australia', 'India', 'United States', 'Egypt',
       'Algeria', 'Kazakhstan', 'Netherlands', 'China', 'Madagascar',
       'Eritrea', 'Greece', 'Iraq', 'Azerbaijan', 'Mali', 'Indonesia',
       'Thailand', 'Central African Republic', 'Spain', 'Venezuela',
       'Colombia', 'Lebanon', 'United Kingdom', 'Serbia', 'Brazil',
       'Libya', 'Germany', 'Switzerland', 'Guinea Bissau', 'Slovakia',
       'Congo', 'Belgium', 'Romania', 'Hungary', 'Burundi', 'Morocco',
       'Russia', 'Moldova', 'Sri Lanka', 'Guinea', 'Denmark', 'Argentina',
       'Senegal', 'Syria', 'Tanzania', 'Bangladesh', 'Qatar', 'Cameroon',
       'Ireland', 'South Africa', 'Tajikistan', 'Mexico', 'Pakistan',
       'Sierra Leone', 'Botswana', 'Guyana', 'Guatemala', 'Ecuador',
       'Vietnam', 'Zimbabwe', 'Finland', 'Japan', 'Sudan', 'Afghanistan',
       'Uganda', 'Taiwan', 'Nepal', 'Ukraine', 'Rwanda', 'Canada',
       'Jamaica', 'Congo (Democratic Republic Of The)', 'Malaysia',
       'Bolivia', 'Gabon', 'Malawi', 'Peru', 'Portugal', 'Slovenia',
       'Chile', 'Angola', 'Zambia', 'Equatorial Guinea', 'Nicaragua',
       'Bahrain', 'Philippines', 'Mozambique', 'Lesotho', 'Iran',
       'Saudi Arabia', 'Italy', 'Belarus', 'Somalia', 'Liberia',
       'Uruguay', 'Kenya', 'Bahamas', 'Niger', 'Mauritania', 'Norway',
       'Burkina Faso', 'Suriname', 'France', 'Montenegro', 'Haiti',
       'Mauritius', 'Papua New Guinea', 'Czech Republic', 'Latvia',
       'El Salvador', 'Dominican Republic', 'Bosnia And Herzegovina',
       'South Korea', 'Hong Kong', 'Singapore', 'Macedonia', 'Bulgaria',
       'Sweden', 'Estonia', 'Uzbekistan', 'Georgia', 'Honduras',
       'Albania', 'Tunisia', 'Mongolia', 'Austria', 'Laos', 'Lithuania',
       'Poland', 'New Zealand', 'Namibia', 'Armenia', 'Croatia'],
      dtype=object)

In [77]:
df_temp["Country"].nunique()

137

In [78]:
df_temp=df_temp.replace({'Guinea Bissau':'Guinea-Bissau','Congo':"Republic of Congo",'Congo (Democratic Republic Of The)'\
                       :"Democratic Republic of the Congo","Macedonia":"North Macedonia",'Czech Republic':"Czechia"})

In [79]:
df_temp["Country"].unique()

array(["CÃ´te D'Ivoire", 'United Arab Emirates', 'Nigeria', 'Ghana',
       'Turkey', 'Australia', 'India', 'United States', 'Egypt',
       'Algeria', 'Kazakhstan', 'Netherlands', 'China', 'Madagascar',
       'Eritrea', 'Greece', 'Iraq', 'Azerbaijan', 'Mali', 'Indonesia',
       'Thailand', 'Central African Republic', 'Spain', 'Venezuela',
       'Colombia', 'Lebanon', 'United Kingdom', 'Serbia', 'Brazil',
       'Libya', 'Germany', 'Switzerland', 'Guinea-Bissau', 'Slovakia',
       'Republic of Congo', 'Belgium', 'Romania', 'Hungary', 'Burundi',
       'Morocco', 'Russia', 'Moldova', 'Sri Lanka', 'Guinea', 'Denmark',
       'Argentina', 'Senegal', 'Syria', 'Tanzania', 'Bangladesh', 'Qatar',
       'Cameroon', 'Ireland', 'South Africa', 'Tajikistan', 'Mexico',
       'Pakistan', 'Sierra Leone', 'Botswana', 'Guyana', 'Guatemala',
       'Ecuador', 'Vietnam', 'Zimbabwe', 'Finland', 'Japan', 'Sudan',
       'Afghanistan', 'Uganda', 'Taiwan', 'Nepal', 'Ukraine', 'Rwanda',
       'Canada', 'Jamaica', 'Democratic Republic of the Congo',
       'Malaysia', 'Bolivia', 'Gabon', 'Malawi', 'Peru', 'Portugal',
       'Slovenia', 'Chile', 'Angola', 'Zambia', 'Equatorial Guinea',
       'Nicaragua', 'Bahrain', 'Philippines', 'Mozambique', 'Lesotho',
       'Iran', 'Saudi Arabia', 'Italy', 'Belarus', 'Somalia', 'Liberia',
       'Uruguay', 'Kenya', 'Bahamas', 'Niger', 'Mauritania', 'Norway',
       'Burkina Faso', 'Suriname', 'France', 'Montenegro', 'Haiti',
       'Mauritius', 'Papua New Guinea', 'Czechia', 'Latvia',
       'El Salvador', 'Dominican Republic', 'Bosnia And Herzegovina',
       'South Korea', 'Hong Kong', 'Singapore', 'North Macedonia',
       'Bulgaria', 'Sweden', 'Estonia', 'Uzbekistan', 'Georgia',
       'Honduras', 'Albania', 'Tunisia', 'Mongolia', 'Austria', 'Laos',
       'Lithuania', 'Poland', 'New Zealand', 'Namibia', 'Armenia',
       'Croatia'], dtype=object)

In [80]:
df_temp["Year"].nunique()

271

In [81]:
df_temp["Year"].unique()

array([1849, 1850, 1851, 1852, 1853, 1854, 1855, 1856, 1857, 1858, 1859,
       1860, 1861, 1862, 1863, 1864, 1865, 1866, 1867, 1868, 1869, 1870,
       1871, 1872, 1873, 1874, 1875, 1876, 1877, 1878, 1879, 1880, 1881,
       1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890, 1891, 1892,
       1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901, 1902, 1903,
       1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912, 1913, 1914,
       1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925,
       1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936,
       1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947,
       1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958,
       1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969,
       1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980,
       1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991,
       1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       1843, 1844, 1845, 1846, 1847, 1848, 1791, 1792, 1793, 1794, 1795,
       1796, 1797, 1798, 1799, 1800, 1801, 1802, 1803, 1804, 1805, 1806,
       1807, 1808, 1809, 1810, 1811, 1812, 1813, 1814, 1815, 1816, 1817,
       1818, 1819, 1820, 1821, 1822, 1823, 1824, 1825, 1826, 1827, 1828,
       1829, 1830, 1831, 1832, 1833, 1834, 1835, 1836, 1837, 1838, 1839,
       1840, 1841, 1842, 1743, 1744, 1745, 1746, 1747, 1748, 1749, 1750,
       1751, 1752, 1753, 1754, 1755, 1756, 1757, 1758, 1759, 1760, 1761,
       1762, 1763, 1764, 1765, 1766, 1767, 1768, 1769, 1770, 1771, 1772,
       1773, 1774, 1775, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1783,
       1784, 1785, 1786, 1787, 1788, 1789, 1790], dtype=int64)

In [82]:
df_temp.isnull().sum()

Year                      0
Country                   0
Average Temperature    2547
dtype: int64

In [83]:
df_temp=df_temp.dropna()

In [84]:
df_temp

       Year        Country  Average Temperature
0      1849  CÃ´te D'Ivoire                25.58
1      1850  CÃ´te D'Ivoire                25.52
2      1851  CÃ´te D'Ivoire                25.67
7      1856  CÃ´te D'Ivoire                26.28
8      1857  CÃ´te D'Ivoire                25.17
...     ...            ...                  ...
71306  2009         Mexico                21.76
71307  2010         Mexico                20.90
71308  2011         Mexico                21.55
71309  2012         Mexico                21.52
71310  2013         Mexico                22.19

[68764 rows x 3 columns]

In [85]:
df_temp.describe()

               Year  Average Temperature
count  68764.000000         68764.000000
mean    1908.742423            16.183876
std       66.060692             7.592960
min     1743.000000           -14.350000
25%     1862.000000             9.750000
50%     1914.000000            16.140000
75%     1964.000000            23.762500
max     2013.000000            30.730000

In [86]:
df_temp[df_temp.duplicated()==True]

       Year        Country  Average Temperature
2143   1978  United States                11.56
2625   1981          India                25.78
3992   1743  United States                 5.34
3993   1744  United States                13.88
3994   1745  United States                 4.00
...     ...            ...                  ...
71306  2009         Mexico                21.76
71307  2010         Mexico                20.90
71308  2011         Mexico                21.55
71309  2012         Mexico                21.52
71310  2013         Mexico                22.19

[5788 rows x 3 columns]

In [87]:
df_temp = df_temp.groupby(["Year", "Country"]).agg({"Average Temperature": "mean"}).reset_index()

In [88]:
df_temp

       Year                 Country  Average Temperature
0      1743                 Albania               12.690
1      1743                 Austria                4.110
2      1743                 Belarus                0.230
3      1743                 Belgium                7.520
4      1743  Bosnia And Herzegovina                4.980
...     ...                     ...                  ...
27474  2013              Uzbekistan               13.660
27475  2013               Venezuela               26.598
27476  2013                 Vietnam               25.780
27477  2013                  Zambia               20.140
27478  2013                Zimbabwe               19.760

[27479 rows x 3 columns]

In [89]:
df_temp[df_temp.duplicated()==True]

Empty DataFrame
Columns: [Year, Country, Average Temperature]
Index: []

In [90]:
df_temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27479 entries, 0 to 27478
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year                 27479 non-null  int64
 1   Country              27479 non-null  object
 2   Average Temperature  27479 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 644.2+ KB

In [91]:
df_temp= df_temp.round(2)

In [92]:
df_temp

       Year                 Country  Average Temperature
0      1743                 Albania                12.69
1      1743                 Austria                 4.11
2      1743                 Belarus                 0.23
3      1743                 Belgium                 7.52
4      1743  Bosnia And Herzegovina                 4.98
...     ...                     ...                  ...
27474  2013              Uzbekistan                13.66
27475  2013               Venezuela                26.60
27476  2013                 Vietnam                25.78
27477  2013                  Zambia                20.14
27478  2013                Zimbabwe                19.76

[27479 rows x 3 columns]

In [93]:
df_crop=pd.read_csv("crop_recommendation.csv")

In [94]:
df_crop

        N   P   K  temperature   humidity        ph    rainfall   label
0      90  42  43    20.879744  82.002744  6.502985  202.935536    rice
1      85  58  41    21.770462  80.319644  7.038096  226.655537    rice
2      60  55  44    23.004459  82.320763  7.840207  263.964248    rice
3      74  35  40    26.491096  80.158363  6.980401  242.864034    rice
4      78  42  42    20.130175  81.604873  7.628473  262.717340    rice
...   ...  ..  ..          ...        ...       ...         ...     ...
2195  107  34  32    26.774637  66.413269  6.780064  177.774507  coffee
2196   99  15  27    27.417112  56.636362  6.086922  127.924610  coffee
2197  118  33  30    24.131797  67.225123  6.362608  173.322839  coffee
2198  117  32  34    26.272418  52.127394  6.758793  127.175293  coffee
2199  104  18  30    23.603016  60.396475  6.779833  140.937041  coffee

[2200 rows x 8 columns]

In [95]:
df_crop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N            2200 non-null   int64
 1   P            2200 non-null   int64
 2   K            2200 non-null   int64
 3   temperature  2200 non-null   float64
 4   humidity     2200 non-null   float64
 5   ph           2200 non-null   float64
 6   rainfall     2200 non-null   float64
 7   label        2200 non-null   object
dtypes: float64(4), int64(3), object(1)
memory usage: 137.6+ KB

In [96]:
df_crop.describe()

,N,P,K,temperature,humidity,ph,rainfall
count,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000
mean,50.551818,53.362727,48.149091,25.616244,71.481779,6.469480,103.463655
std,36.917334,32.985883,50.647931,5.063749,22.263812,0.773938,54.958389
min,0.000000,5.000000,5.000000,8.825675,14.258040,3.504752,20.211267
25%,21.000000,28.000000,20.000000,22.769375,60.261953,5.971693,64.551686
50%,37.000000,51.000000,32.000000,25.598693,80.473146,6.425045,94.867624
75%,84.250000,68.000000,49.000000,28.561654,89.948771,6.923643,124.267508
max,140.000000,145.000000,205.000000,43.675493,99.981876,9.935091,298.560117

In [97]:
df_crop[df_crop["N"]==0]

      N    P    K  temperature   humidity        ph    rainfall        label
346   0   65   15    23.461683  23.221976  5.645436   95.842534  kidneybeans
382   0   55   22    22.986669  20.579406  5.916779  143.858494  kidneybeans
477   0   70   21    36.300497  56.030213  4.672437  101.607399   pigeonpeas
517   0   55   25    28.174894  43.667230  4.524172   45.781728    mothbeans
608   0   49   18    29.683617  87.935981  6.990095   41.824902     mungbean
829   0   65   24    28.495844  62.446162  7.841496   53.145310       lentil
875   0   69   21    25.869282  61.883211  7.072923   36.682840       lentil
878   0   74   17    23.333759  64.505158  7.240988   47.015107       lentil
891   0   67   22    29.821121  69.407321  6.593798   51.564611       lentil
904   0   27   38    22.445813  89.901470  6.738016  109.390600  pomegranate
925   0   17   42    23.202426  91.194427  6.859841  109.094632  pomegranate
975   0    5   36    24.351938  90.886124  6.152907  105.529185  pomegranate
1104  0   21   32    35.898556  54.259642  6.430139   92.197217        mango
1179  0   17   30    35.474783  47.972305  6.279134   97.790725        mango
1184  0   36   26    34.130722  51.257862  5.101206   96.388080        mango
1243  0  137  195    22.435902  80.186121  6.329500   65.397317       grapes
1507  0  123  205    22.027754  92.961295  5.790993  121.134918        apple
1514  0  133  200    23.672877  90.493557  5.708419  104.229803        apple
1588  0  145  205    21.225034  90.098778  5.520783  113.976046        apple
1607  0   18   14    29.771494  92.007200  7.207991  114.416179       orange
1621  0   25   14    19.335168  91.979789  6.361671  116.450422       orange
1635  0   12    7    20.184323  90.654585  6.969250  116.813097       orange
1641  0   23   15    22.566642  93.374889  7.598729  109.858575       orange
1815  0   19   33    27.132601  95.237980  6.234458  204.720657      coconut
1857  0   29   32    28.059124  98.367098  5.868256  171.651640      coconut
1874  0   26   31    25.070725  95.021568  5.547933  192.903631      coconut
1878  0   19   31    25.517913  94.384206  6.271953  178.729772      coconut

In [98]:
df_crop.isnull().sum()

N              0
P              0
K              0
temperature    0
humidity       0
ph             0
rainfall       0
label          0
dtype: int64

In [99]:
df_crop.isna().sum()

N              0
P              0
K              0
temperature    0
humidity       0
ph             0
rainfall       0
label          0
dtype: int64

In [100]:
df_crop = df_crop.rename(columns={"temperature": "Temperature","humidity":"Humidity","ph":"pH","rainfall":"Rainfall","label":"Label"})

In [101]:
df_crop

        N   P   K  Temperature   Humidity        pH    Rainfall   Label
0      90  42  43    20.879744  82.002744  6.502985  202.935536    rice
1      85  58  41    21.770462  80.319644  7.038096  226.655537    rice
2      60  55  44    23.004459  82.320763  7.840207  263.964248    rice
3      74  35  40    26.491096  80.158363  6.980401  242.864034    rice
4      78  42  42    20.130175  81.604873  7.628473  262.717340    rice
...   ...  ..  ..          ...        ...       ...         ...     ...
2195  107  34  32    26.774637  66.413269  6.780064  177.774507  coffee
2196   99  15  27    27.417112  56.636362  6.086922  127.924610  coffee
2197  118  33  30    24.131797  67.225123  6.362608  173.322839  coffee
2198  117  32  34    26.272418  52.127394  6.758793  127.175293  coffee
2199  104  18  30    23.603016  60.396475  6.779833  140.937041  coffee

[2200 rows x 8 columns]

In [102]:
df_crop[df_crop.duplicated()==True]

Empty DataFrame
Columns: [N, P, K, Temperature, Humidity, pH, Rainfall, Label]
Index: []

In [103]:
df_crop=df_crop.round(2)

In [104]:
df_crop

        N   P   K  Temperature  Humidity    pH  Rainfall   Label
0      90  42  43        20.88     82.00  6.50    202.94    rice
1      85  58  41        21.77     80.32  7.04    226.66    rice
2      60  55  44        23.00     82.32  7.84    263.96    rice
3      74  35  40        26.49     80.16  6.98    242.86    rice
4      78  42  42        20.13     81.60  7.63    262.72    rice
...   ...  ..  ..          ...       ...   ...       ...     ...
2195  107  34  32        26.77     66.41  6.78    177.77  coffee
2196   99  15  27        27.42     56.64  6.09    127.92  coffee
2197  118  33  30        24.13     67.23  6.36    173.32  coffee
2198  117  32  34        26.27     52.13  6.76    127.18  coffee
2199  104  18  30        23.60     60.40  6.78    140.94  coffee

[2200 rows x 8 columns]

In [105]:
df_yield.to_csv("../Resources/yield.csv",index=False)

In [106]:
df_rain.to_csv("../Resources/rainfall.csv",index=False)

In [107]:
df_pes.to_csv("../Resources/pesticides.csv",index=False)

In [108]:
df_temp.to_csv("../Resources/temp.csv",index=False)

In [109]:
df_crop.to_csv("../Resources/Crop_recommendation.csv",index=False)